; domain
; LO QUE DIJERON EN CLASE
; para contar lo que debemos hacer es crear predicados que sean
;      n0, n1, n2, ..., nk y poner a true sólo el numero que llevamos
; cuidado al enganchar, no se pueden desenganchar vagones con paquetes
; no se puede enganchar un vagón al medio
; No hace falta desenganchar un vagón para dejar un paquete
; No se puede dejar un paquete sospechoso
; El método para inspeccionar da igual (dejar paquete, vagón o tren entero) pero debemos dejarlo explicado
; ESTÁ PROHIBIDO USAR PRECONDICIONES NEGATIVAS PORQUE EL PLANIFICADOR OPTIC NO LAS SOPORTA

(define (domain aeropuerto)
    (:requirements :strips :typing)
    (:types
      ubicacion
      maquina
      vagon
      equipaje
    )

     (:predicates
    ; Grafo de la terminal
    (siguiente ?desde - ubicacion ?hasta - ubicacion) ; Se puede ir desde, hasta según el mapa

    ; Global
    (esta-en ?m - (either maquina equipaje vagon) ?u - ubicacion)   ; la máquina m está en la ubicación u
    
    ; Vehículos
    (enganchado ?v - vagon ?m - (either maquina vagon)) ; el vagón v está enganchado a la máquina m
    (vagon-suelto ?v - vagon)                  ; v está suelto (no enganchado a ninguna máquina)
    (libre ?m - (either maquina vagon))

    ; Equipajes
    (equipaje-en-vagon ?e - equipaje ?v - vagon)    ; e está dentro del vagón v

    ; Contador de capacidad del vagón (capacidad = 2)
    (n0 ?v - vagon)
    (n1 ?v - vagon)
    (n2 ?v - vagon)

    ; Tipo de equipaje
    (normal ?e - equipaje)
    (sospechoso ?e - equipaje)

    ; Marcar oficina de inspección
    (es-oficina-inspeccion ?u - ubicacion)
  )

  ; Mover la máquina por el grafo

  (:action mover-maquina
    :parameters (?m - maquina ?desde ?hasta - ubicacion)
    :precondition (and
      (esta-en ?m ?desde)
      (siguiente ?desde ?hasta)
    )
    :effect (and
      (esta-en ?m ?hasta)
      (not (esta-en ?m ?desde))
    )
  )

  ;   Enganchar / desenganchar vagones 

  (:action enganchar-vagon
    :parameters (?v - vagon ?m - (either maquina vagon) ?u - ubicacion)
    :precondition (and
      (vagon-suelto ?v)
      (n0 ?v)
      (esta-en ?v ?u)
      (esta-en ?m ?u)
      (libre ?m)
    )
    :effect (and
      (enganchado ?v ?m)
      (not (vagon-suelto ?v))
      (not (esta-en ?v ?u))
      (not (libre ?m))
      (libre ?v)
    )
  )

  (:action desenganchar-vagon
    :parameters (?v - vagon ?m - (either maquina vagon) ?u - ubicacion)
    :precondition (and
      (enganchado ?v ?m)
      (n0 ?v)
      (esta-en ?m ?u)
    )
    :effect (and
      (vagon-suelto ?v)
      (not (libre ?v))
      (esta-en ?v ?u)
      (not (enganchado ?v ?m))
      (libre ?m)
    )
  )

  ;   Cargar equipajes en vagones

  ; Dos acciones: 0→1 y 1→2 (contador n0/n1/n2).
  ; El vagón debe estar enganchado a la máquina en la misma ubicación.

  (:action cargar-equipaje-0-1
    :parameters (?e - equipaje ?v - vagon ?m - maquina ?u - ubicacion)
    :precondition (and
      (esta-en ?m ?u)
      (enganchado ?v ?m)
      (esta-en ?e ?u)
      (n0 ?v)
    )
    :effect (and
      (equipaje-en-vagon ?e ?v)
      (not (esta-en ?e ?u))
      (n1 ?v)
      (not (n0 ?v))
    )
  )

  (:action cargar-equipaje-1-2
    :parameters (?e - equipaje ?v - vagon ?m - maquina ?u - ubicacion)
    :precondition (and
      (esta-en ?m ?u)
      (enganchado ?v ?m)
      (esta-en ?e ?u)
      (n1 ?v)
    )
    :effect (and
      (equipaje-en-vagon ?e ?v)
      (not (esta-en ?e ?u))
      (n2 ?v)
      (not (n1 ?v))
    )
  )

  ;   Descargar equipajes normales

  ; No hace falta desenganchar el vagón.
  ; Se descarga donde esté la máquina.

  (:action descargar-normal-1-0
    :parameters (?e - equipaje ?v - vagon ?m - maquina ?u - ubicacion)
    :precondition (and
      (normal ?e)
      (equipaje-en-vagon ?e ?v)
      (enganchado ?v ?m)
      (esta-en ?m ?u)
      (n1 ?v)
    )
    :effect (and
      (esta-en ?e ?u)
      (not (equipaje-en-vagon ?e ?v))
      (n0 ?v)
      (not (n1 ?v))
    )
  )

  (:action descargar-normal-2-1
    :parameters (?e - equipaje ?v - vagon ?m - maquina ?u - ubicacion)
    :precondition (and
      (normal ?e)
      (equipaje-en-vagon ?e ?v)
      (enganchado ?v ?m)
      (esta-en ?m ?u)
      (n2 ?v)
    )
    :effect (and
      (esta-en ?e ?u)
      (not (equipaje-en-vagon ?e ?v))
      (n1 ?v)
      (not (n2 ?v))
    )
  )

  ;   Inspeccionar Equipajes

  ; Una vez en la oficina de inspección, el equipaje deja de ser sospechoso

  (:action inspeccionar-equipaje
    :parameters (?e - equipaje ?u - ubicacion ?v - vagon ?m - maquina)
    :precondition (and
      (sospechoso ?e)
      (equipaje-en-vagon ?e ?v)
      (enganchado ?v ?m)
      (esta-en ?m ?u)
      (es-oficina-inspeccion ?u)
    )
    :effect (and
      (normal ?e)
      (not (sospechoso ?e))
    )
  )

)

; problem
(define (problem aeropuerto-p1)
  (:domain aeropuerto)

  (:objects
    ;; ubicaciones
    facturacion recogida inspeccion
    puerta1 puerta2 puerta3 puerta4
    puerta5 puerta6 puerta7 puerta8 - ubicacion

    ;; maquinas
    m1 m2 - maquina

    ;; vagones
    v1 v2 v3 v4 v5 - vagon

    ;; equipajes
    e1 e2 e3 e4 e5 e6 - equipaje
  )

  (:init
    ;; ---------- Estructura de la terminal ----------
    ;; zona común
    (siguiente facturacion recogida)
    (siguiente recogida facturacion)

    (siguiente facturacion inspeccion)
    (siguiente inspeccion facturacion)

    (siguiente recogida inspeccion)
    (siguiente inspeccion recogida)

    ;; conexiones con puertas
    (siguiente facturacion puerta2)
    (siguiente puerta2 facturacion)

    (siguiente recogida puerta6)
    (siguiente puerta6 recogida)

    (siguiente inspeccion puerta1)
    (siguiente puerta1 inspeccion)

    (siguiente inspeccion puerta5)
    (siguiente puerta5 inspeccion)

    ;; pasillo izquierdo: puertas contiguas 2–4–3–1
    (siguiente puerta2 puerta4)
    (siguiente puerta4 puerta2)

    (siguiente puerta4 puerta3)
    (siguiente puerta3 puerta4)

    (siguiente puerta3 puerta1)
    (siguiente puerta1 puerta3)

    ;; pasillo derecho: puertas contiguas 6–8–7–5
    (siguiente puerta6 puerta8)
    (siguiente puerta8 puerta6)

    (siguiente puerta8 puerta7)
    (siguiente puerta7 puerta8)

    (siguiente puerta7 puerta5)
    (siguiente puerta5 puerta7)

    ;; ---------- Oficina de inspección ----------
    (es-oficina-inspeccion inspeccion)

    ;; ---------- Vehículos ----------
    ;; tres vagones sueltos en puerta1
    (esta-en v1 puerta1)
    (esta-en v2 puerta1)
    (esta-en v3 puerta1)

    ;; dos vagones sueltos en puerta5
    (esta-en v4 puerta5)
    (esta-en v5 puerta5)

    ;; todos los vagones empiezan libres y vacíos (n0)
    (vagon-suelto v1)
    (vagon-suelto v2)
    (vagon-suelto v3)
    (vagon-suelto v4)
    (vagon-suelto v5)

    (n0 v1)
    (n0 v2)
    (n0 v3)
    (n0 v4)
    (n0 v5)

    (libre m1)
    (libre m2)

    (not (libre v1))
    (not (libre v2))
    (not (libre v3))
    (not (libre v4))
    (not (libre v5))

    ;; dos máquinas en la zona de recogida
    (esta-en m1 recogida)
    (esta-en m2 recogida)

    ;; ---------- Equipajes ----------
    ;; 1) no sospechoso facturado → puerta4
    (esta-en e1 facturacion)
    (normal e1)

    ;; 2) no sospechoso facturado → puerta8
    (esta-en e2 facturacion)
    (normal e2)

    ;; 3) sospechoso llega a puerta6 → recogida (pasando por inspección)
    (esta-en e3 puerta6)
    (sospechoso e3)

    ;; 4) no sospechoso llega a puerta6 → recogida
    (esta-en e4 puerta6)
    (normal e4)

    ;; 5) no sospechoso llega a puerta2 → recogida
    (esta-en e5 puerta2)
    (normal e5)

    ;; 6) sospechoso llega a puerta2 → recogida (pasando por inspección)
    (esta-en e6 puerta2)
    (sospechoso e6)
    )

  (:goal
    (and
      ;; destinos finales
      (esta-en e1 puerta4)
      (esta-en e2 puerta8)

      (esta-en e3 recogida)
      (esta-en e4 recogida)
      (esta-en e5 recogida)
      (esta-en e6 recogida)

      ;; los sospechosos han tenido que ser inspeccionados
      (normal e3)
      (normal e6)
    )
  )
)

; plan
1. (mover-maquina m1 recogida inspeccion)
   deleted: (esta-en m1 recogida)
   added: (esta-en m1 inspeccion)
   goals met: 0 of 8
2. (mover-maquina m1 inspeccion puerta1)
   deleted: (esta-en m1 inspeccion)
   added: (esta-en m1 puerta1)
   goals met: 0 of 8
3. (enganchar-vagon v2 m1 puerta1)
   deleted: (vagon-suelto v2) (esta-en v2 puerta1) (libre m1)
   added: (enganchado v2 m1) (libre v2)
   goals met: 0 of 8
4. (mover-maquina m1 puerta1 inspeccion)
   deleted: (esta-en m1 puerta1)
   added: (esta-en m1 inspeccion)
   goals met: 0 of 8
5. (mover-maquina m1 inspeccion facturacion)
   deleted: (esta-en m1 inspeccion)
   added: (esta-en m1 facturacion)
   goals met: 0 of 8
6. (cargar-equipaje-0-1 e1 v2 m1 facturacion)
   deleted: (esta-en e1 facturacion) (n0 v2)
   added: (equipaje-en-vagon e1 v2) (n1 v2)
   goals met: 0 of 8
7. (mover-maquina m1 facturacion puerta2)
   deleted: (esta-en m1 facturacion)
   added: (esta-en m1 puerta2)
   goals met: 0 of 8
8. (mover-maquina m1 puerta2 puerta4)
   deleted: (esta-en m1 puerta2)
   added: (esta-en m1 puerta4)
   goals met: 0 of 8
9. (descargar-normal-1-0 e1 v2 m1 puerta4)
   deleted: (equipaje-en-vagon e1 v2) (n1 v2)
   added: (esta-en e1 puerta4) (n0 v2)
   goals met: 1 of 8
10. (mover-maquina m1 puerta4 puerta2)
   deleted: (esta-en m1 puerta4)
   added: (esta-en m1 puerta2)
   goals met: 1 of 8
11. (cargar-equipaje-0-1 e6 v2 m1 puerta2)
   deleted: (esta-en e6 puerta2) (n0 v2)
   added: (equipaje-en-vagon e6 v2) (n1 v2)
   goals met: 1 of 8
12. (cargar-equipaje-1-2 e5 v2 m1 puerta2)
   deleted: (esta-en e5 puerta2) (n1 v2)
   added: (equipaje-en-vagon e5 v2) (n2 v2)
   goals met: 1 of 8
13. (mover-maquina m1 puerta2 facturacion)
   deleted: (esta-en m1 puerta2)
   added: (esta-en m1 facturacion)
   goals met: 1 of 8
14. (mover-maquina m1 facturacion inspeccion)
   deleted: (esta-en m1 facturacion)
   added: (esta-en m1 inspeccion)
   goals met: 1 of 8
15. (inspeccionar-equipaje e6 inspeccion v2 m1)
   deleted: (sospechoso e6)
   added: (normal e6)
   goals met: 2 of 8
16. (mover-maquina m1 inspeccion recogida)
   deleted: (esta-en m1 inspeccion)
   added: (esta-en m1 recogida)
   goals met: 2 of 8
17. (descargar-normal-2-1 e6 v2 m1 recogida)
   deleted: (equipaje-en-vagon e6 v2) (n2 v2)
   added: (esta-en e6 recogida) (n1 v2)
   goals met: 3 of 8
18. (descargar-normal-1-0 e5 v2 m1 recogida)
   deleted: (equipaje-en-vagon e5 v2) (n1 v2)
   added: (esta-en e5 recogida) (n0 v2)
   goals met: 4 of 8
19. (mover-maquina m1 recogida facturacion)
   deleted: (esta-en m1 recogida)
   added: (esta-en m1 facturacion)
   goals met: 4 of 8
20. (cargar-equipaje-0-1 e2 v2 m1 facturacion)
   deleted: (esta-en e2 facturacion) (n0 v2)
   added: (equipaje-en-vagon e2 v2) (n1 v2)
   goals met: 4 of 8
21. (mover-maquina m1 facturacion recogida)
   deleted: (esta-en m1 facturacion)
   added: (esta-en m1 recogida)
   goals met: 4 of 8
22. (mover-maquina m1 recogida puerta6)
   deleted: (esta-en m1 recogida)
   added: (esta-en m1 puerta6)
   goals met: 4 of 8
23. (mover-maquina m1 puerta6 puerta8)
   deleted: (esta-en m1 puerta6)
   added: (esta-en m1 puerta8)
   goals met: 4 of 8
24. (descargar-normal-1-0 e2 v2 m1 puerta8)
   deleted: (equipaje-en-vagon e2 v2) (n1 v2)
   added: (esta-en e2 puerta8) (n0 v2)
   goals met: 5 of 8
25. (mover-maquina m1 puerta8 puerta6)
   deleted: (esta-en m1 puerta8)
   added: (esta-en m1 puerta6)
   goals met: 5 of 8
26. (cargar-equipaje-0-1 e3 v2 m1 puerta6)
   deleted: (esta-en e3 puerta6) (n0 v2)
   added: (equipaje-en-vagon e3 v2) (n1 v2)
   goals met: 5 of 8
27. (cargar-equipaje-1-2 e4 v2 m1 puerta6)
   deleted: (esta-en e4 puerta6) (n1 v2)
   added: (equipaje-en-vagon e4 v2) (n2 v2)
   goals met: 5 of 8
28. (mover-maquina m1 puerta6 recogida)
   deleted: (esta-en m1 puerta6)
   added: (esta-en m1 recogida)
   goals met: 5 of 8
29. (descargar-normal-2-1 e4 v2 m1 recogida)
   deleted: (equipaje-en-vagon e4 v2) (n2 v2)
   added: (esta-en e4 recogida) (n1 v2)
   goals met: 6 of 8
30. (mover-maquina m1 recogida inspeccion)
   deleted: (esta-en m1 recogida)
   added: (esta-en m1 inspeccion)
   goals met: 6 of 8
31. (inspeccionar-equipaje e3 inspeccion v2 m1)
   deleted: (sospechoso e3)
   added: (normal e3)
   goals met: 7 of 8
32. (mover-maquina m1 inspeccion recogida)
   deleted: (esta-en m1 inspeccion)
   added: (esta-en m1 recogida)
   goals met: 7 of 8
33. (descargar-normal-1-0 e3 v2 m1 recogida)
   deleted: (equipaje-en-vagon e3 v2) (n1 v2)
   added: (esta-en e3 recogida) (n0 v2)
   goals met: 8 of 8
